app/controllers/carts_controller.rb

SELECT "items".* FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1  [["cart_id", 2]]
---
  def show
    @globalprice = 0
    @items = current_user.cart.items
    @items.each do |item|