app/controllers/items_controller.rb

  def index
    @item = Item.all
---
SELECT "items".* FROM "items"

  def show
    @it = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]