app/controllers/orderitem_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1  [["cart_id", 5]]
SELECT "items".* FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1  [["cart_id", 2]]
DELETE FROM "itemcarts" WHERE "itemcarts"."id" = $1  [["id", 3]]
SELECT  "itemcarts".* FROM "itemcarts" WHERE "itemcarts"."cart_id" = $1 AND "itemcarts"."item_id" = $2 LIMIT $3  [["cart_id", 2], ["item_id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2019-11-28 12:39:04.574640"], ["updated_at", "2019-11-28 12:39:04.574640"]]
---
  def create
      amount = 0
      current_user.cart.items.each do |item|
        amount += item.price
      end
      @amount = (amount * 100).round

      customer = Stripe::Customer.create({
        email: params[:stripeEmail],
        source: params[:stripeToken],
      })

      charge = Stripe::Charge.create({
        customer: customer.id,
        amount: @amount,
        description: 'Rails Stripe customer',
        currency: 'eur',
      })

      order = Order.new(user: current_user, items: current_user.cart.items)
      current_user.cart.items.each do |item|
        Itemcart.find_by(cart: current_user.cart, item: item).destroy
      end
      order.save