app/views/layouts/_item_show_photo_description.html.erb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1 AND "items"."id" = $2 LIMIT $3  [["cart_id", 2], ["id", 1], ["LIMIT", 1]]
---
          <%if user_signed_in?%>
              <% if current_user.cart.items.include?(item)  %>