app/views/layouts/_navbar.html.erb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "itemcarts" ON "items"."id" = "itemcarts"."item_id" WHERE "itemcarts"."cart_id" = $1  [["cart_id", 2]]
---
            <span class="mx-4" style="font-size: 25px; line-height:30px;">
              <i class="fas fa-shopping-basket mr-2"></i><small class="text-light"><%=current_user.cart.items.length %> articles</small>